load-tests/load-test-light.yml
# Artillery Load Test - Light Load
# Simulates low to moderate traffic (10-50 users)
# Use this for development and initial testing

config:
  target: "http://localhost:3000"
  phases:
    # Warm-up phase
    - duration: 30
      arrivalRate: 5
      name: "Warm-up"

    # Ramp-up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: "Ramp-up"

    # Sustained load phase
    - duration: 120
      arrivalRate: 20
      name: "Sustained load"

    # Peak load phase
    - duration: 60
      arrivalRate: 50
      name: "Peak load"

    # Cool-down phase
    - duration: 30
      arrivalRate: 10
      name: "Cool-down"

  # Performance thresholds
  ensure:
    maxErrorRate: 1  # Max 1% error rate
    p95: 200         # 95th percentile response time < 200ms
    p99: 500         # 99th percentile response time < 500ms

  # HTTP settings
  http:
    timeout: 10

  # Metrics plugins
  plugins:
    expect: {}

  # Output settings
  processor: "./load-test-processor.js"

scenarios:
  # Scenario 1: Health check monitoring (20% of traffic)
  - name: "Health Check"
    weight: 20
    flow:
      - get:
          url: "/healthz"
          expect:
            - statusCode: 200
            - contentType: json

  # Scenario 2: Metrics endpoint (10% of traffic)
  - name: "Metrics Collection"
    weight: 10
    flow:
      - get:
          url: "/metrics"
          expect:
            - statusCode: 200

  # Scenario 3: Latest rate query (50% of traffic)
  - name: "Get Latest Rate"
    weight: 50
    flow:
      - get:
          url: "/api/rate/latest"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: "rate"

  # Scenario 4: Historical rate query (15% of traffic)
  - name: "Get Rate by Date"
    weight: 15
    flow:
      - get:
          url: "/api/rate/{{ $randomString() | date }}"
          expect:
            - statusCode:
                - 200
                - 404  # Valid response if date doesn't exist

  # Scenario 5: Rate history (5% of traffic)
  - name: "Get Rate History"
    weight: 5
    flow:
      - get:
          url: "/api/rate/history"
          expect:
            - statusCode: 200
            - contentType: json