load-tests/load-test-stress.yml
# Artillery Load Test - Stress Test
# Simulates high traffic and stress conditions (200-1000 users)
# Use this to find breaking points and maximum capacity

config:
  target: "http://localhost:3000"
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 50
      name: "Warm-up"

    # Gradual ramp-up
    - duration: 180
      arrivalRate: 50
      rampTo: 300
      name: "Ramp-up to 300"

    # Sustained high load
    - duration: 300
      arrivalRate: 300
      name: "Sustained 300 users"

    # Ramp to breaking point
    - duration: 180
      arrivalRate: 300
      rampTo: 600
      name: "Ramp-up to 600"

    # Peak stress
    - duration: 120
      arrivalRate: 600
      name: "Peak stress 600"

    # Extreme spike
    - duration: 60
      arrivalRate: 1000
      name: "Spike to 1000"

    # Recovery phase
    - duration: 120
      arrivalRate: 100
      name: "Recovery"

  # Relaxed thresholds for stress testing
  ensure:
    maxErrorRate: 5  # Max 5% error rate (acceptable under stress)
    p95: 1000        # 95th percentile < 1s
    p99: 3000        # 99th percentile < 3s

  # HTTP settings
  http:
    timeout: 30

  # Metrics plugins
  plugins:
    expect: {}

  # Output settings
  processor: "./load-test-processor.js"

scenarios:
  # Scenario 1: Health check monitoring (10% of traffic)
  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/healthz"
          expect:
            - statusCode: 200

  # Scenario 2: Latest rate query (70% of traffic - main endpoint)
  - name: "Get Latest Rate"
    weight: 70
    flow:
      - get:
          url: "/api/rate/latest"
          expect:
            - statusCode: 200

  # Scenario 3: Historical rate query (15% of traffic)
  - name: "Get Rate by Date"
    weight: 15
    flow:
      - get:
          url: "/api/rate/2024-01-15"
          expect:
            - statusCode: 200

  # Scenario 4: Rate history (5% of traffic)
  - name: "Get Rate History"
    weight: 5
    flow:
      - get:
          url: "/api/rate/history"
          expect:
            - statusCode: 200